Revit 2017 API
StructuralSectionRoundHSS Class
 Defines parameters for pipes known as Round HSS (HollowStructuralSection).
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2015
Syntax
C#
public class StructuralSectionRoundHSS : StructuralSectionRound
Visual Basic
Public Class StructuralSectionRoundHSS _
	Inherits StructuralSectionRound
Visual C++
public ref class StructuralSectionRoundHSS : public StructuralSectionRound
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRoundHSS
See Also
StructuralSectionRoundHSS Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace